In [1]:
import pandas as pd
import numpy as np

# What is Pandas?

- Pandas is a short form for Panel Data(Pan - Panel & Da - Data & s is the addtional word added)
- Library used for Data Analysis and Data Wrangling
- Array are basic core of NumPy in the same way Series and DataFrame are the core building blocks fo Pandas

# What is a Series?
- Series: When the data is stored as a single column we call it as Series

In [2]:
ser = pd.Series([12, 17, 25, 57, 87,62, 98, 26])
ser

0    12
1    17
2    25
3    57
4    87
5    62
6    98
7    26
dtype: int64

In [3]:
type(ser)

pandas.core.series.Series

In [4]:
ser1 = pd.Series([12, 17, 25, 57, 87,62, 98, 26], index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
ser1

a    12
b    17
c    25
d    57
e    87
f    62
g    98
h    26
dtype: int64

In [5]:
ser

0    12
1    17
2    25
3    57
4    87
5    62
6    98
7    26
dtype: int64

In [6]:
ser[3]

57

In [7]:
ser1

a    12
b    17
c    25
d    57
e    87
f    62
g    98
h    26
dtype: int64

In [10]:
ser1['d']

57

In [11]:
ser1['g']

98

In [13]:
ser1["d" : "h"]

d    57
e    87
f    62
g    98
h    26
dtype: int64

## What is DataFrame?
- DataFrame : Data stored in a table with many rows and many columns

In [14]:
dic = {
    "a" : [12, 19, 75, 49, 92, 37],
    "b" : [1, 2, 3, 4, 5, 6],
    "c" : ['a', 'b', 'c', 'd', 'e', 'f']
}
dic

{'a': [12, 19, 75, 49, 92, 37],
 'b': [1, 2, 3, 4, 5, 6],
 'c': ['a', 'b', 'c', 'd', 'e', 'f']}

In [15]:
df = pd.DataFrame(dic)
df

    a  b  c
0  12  1  a
1  19  2  b
2  75  3  c
3  49  4  d
4  92  5  e
5  37  6  f

## Note:

- Output is a table
- Table is having 6 rows and 3 columns
- Output is a DataFrame
- From the dict, the keys have become the column names in the DataFrame

In [16]:
type(df)

pandas.core.frame.DataFrame

In [19]:
dic = {
    "a" : [12, 19, 75, 49, 92, 37],
    "b" : [1, 2, 3, 4, 5, 6],
    "c" : ['a', 'b', 'c', 'd', np.nan, np.nan]
}
dic

{'a': [12, 19, 75, 49, 92, 37],
 'b': [1, 2, 3, 4, 5, 6],
 'c': ['a', 'b', 'c', 'd', nan, nan]}

In [20]:
pd.DataFrame(dic)

    a  b    c
0  12  1    a
1  19  2    b
2  75  3    c
3  49  4    d
4  92  5  NaN
5  37  6  NaN

# Load the data in jupyter notebook

In [21]:
## Sample data
## to load the data from an excel we have to use read_csv() or read_excel()
data1 = pd.read_csv("Sample data.csv")
data1

    Name  Age  Salary Gender
0   Anil   22   25000      M
1  Sunil   24   35000      M
2  Ashok   26   45000      M
3  Seema   28   55000      F
4  Reema   30   65000      F

- When the data from the excel file is loaded into jupyter notebook, the data is present in the form of a table with many rows and many columns which is a DataFrame

In [22]:
type(data1)

pandas.core.frame.DataFrame

In [23]:
data2 = pd.read_excel("Sample data.xlsx")
data2

    Name  Age  Salary Gender
0   Anil   22   25000      M
1  Sunil   24   35000      M
2  Ashok   26   45000      M
3  Seema   28   55000      F
4  Reema   30   65000      F

In [24]:
## The dataset is present in some other folder and you want to load the dataset into jupyter notebook

data3 = pd.read_csv(r"C:\Users\AMANT\Downloads\stock_data.csv")
data3

      Unnamed: 0        Date   Open   High    Low  Close    Volume  Name
0            NaN    1/3/2006  39.69  41.22  38.79  40.91  24232729  AABA
1            NaN    1/4/2006  41.22  41.90  40.77  40.97  20553479  AABA
2            NaN    1/5/2006  40.93  41.73  40.85  41.53  12829610  AABA
3            NaN    1/6/2006  42.88  43.57  42.80  43.21  29422828  AABA
4            NaN    1/9/2006  43.10  43.66  42.82  43.42  16268338  AABA
...          ...         ...    ...    ...    ...    ...       ...   ...
3014         NaN  12/22/2017  71.42  71.87  71.22  71.58  10979165  AABA
3015         NaN  12/26/2017  70.94  71.39  69.63  69.86   8542802  AABA
3016         NaN  12/27/2017  69.77  70.49  69.69  70.06   6345124  AABA
3017         NaN  12/28/2017  70.12  70.32  69.51  69.82   7556877  AABA
3018         NaN  12/29/2017  69.79  70.13  69.43  69.85   6613070  AABA

[3019 rows x 8 columns]

In [25]:
data4 = pd.read_csv("titanicdata.csv")
data4

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

# Indexing in DataFrame:
### 2 Types:
### 1. Column Indexing
### 2. Row Indexing

In [27]:
data1

    Name  Age  Salary Gender
0   Anil   22   25000      M
1  Sunil   24   35000      M
2  Ashok   26   45000      M
3  Seema   28   55000      F
4  Reema   30   65000      F

In [28]:
## Select Age and print the Age column value in the output

data1["Age"]

0    22
1    24
2    26
3    28
4    30
Name: Age, dtype: int64

## Note:
- When Age column is selected and displayed in the output. We see that Age is displayed a single column.
- Data in a single column is a Series
- Hence, Age column is displayed as a Series.

In [31]:
data1["Salary"]

0    25000
1    35000
2    45000
3    55000
4    65000
Name: Salary, dtype: int64

## Note:
- Each Individual column from a DataFrame is present in the form of Series.

In [32]:
data1

    Name  Age  Salary Gender
0   Anil   22   25000      M
1  Sunil   24   35000      M
2  Ashok   26   45000      M
3  Seema   28   55000      F
4  Reema   30   65000      F

In [33]:
## Select only Name and Salary in the output

ls = ["Name", "Salary"]
data1[ls]

    Name  Salary
0   Anil   25000
1  Sunil   35000
2  Ashok   45000
3  Seema   55000
4  Reema   65000

In [34]:
data1[["Name", "Salary"]]

    Name  Salary
0   Anil   25000
1  Sunil   35000
2  Ashok   45000
3  Seema   55000
4  Reema   65000

# 2. Row Indexing

In [35]:
data1

    Name  Age  Salary Gender
0   Anil   22   25000      M
1  Sunil   24   35000      M
2  Ashok   26   45000      M
3  Seema   28   55000      F
4  Reema   30   65000      F

In [38]:
## Select and dispaly all the details about Ashok in the output
## data["Name"]
data1["2"]

KeyError: '2'

In [39]:
data1

    Name  Age  Salary Gender
0   Anil   22   25000      M
1  Sunil   24   35000      M
2  Ashok   26   45000      M
3  Seema   28   55000      F
4  Reema   30   65000      F

In [44]:
data1.iloc[3]   ## iloc stand for index location (i = Index, loc = location)

Name      Seema
Age          28
Salary    55000
Gender        F
Name: 3, dtype: object

## Note:
- When a single row is selected and displayed in the output. The data is stored in a single column and the index is the column names from the DataFrame.
- Each Single row of a DataFrame is individually a Series.

In [45]:
data1

    Name  Age  Salary Gender
0   Anil   22   25000      M
1  Sunil   24   35000      M
2  Ashok   26   45000      M
3  Seema   28   55000      F
4  Reema   30   65000      F

In [46]:
## Select and display all the details of Sunil and Reema
ls = [1, 4]
data1.iloc[ls]

    Name  Age  Salary Gender
1  Sunil   24   35000      M
4  Reema   30   65000      F

In [48]:
## Select and dispaly Seema's Salary in the output
## only Seema's details
## only salary details

data1.iloc[3]["Salary"]   ## not recommended

55000

In [51]:
data1.iloc[3, 2]         ## 3 is indicating row index and 2 indicating column index

55000

In [53]:
data1.loc[3, "Salary"]

55000

In [55]:
data1.iloc[3, "Salary"]    ## 3 is row index but "Salary" is column name hence raises error

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

## Note:

- iloc - strictly specify index positions for both row and column
- loc - can specify the Names of the columns as it is

In [56]:
data1

    Name  Age  Salary Gender
0   Anil   22   25000      M
1  Sunil   24   35000      M
2  Ashok   26   45000      M
3  Seema   28   55000      F
4  Reema   30   65000      F

In [57]:
data1.iloc[2, 3]

'M'

In [58]:
data1.loc[2, "Gender"]

'M'

In [59]:
## Display Name and Salary for Ashok and Reema

# Using loc method
row_index = [2, 4]
col_names = ["Name", "Salary"]

data1.loc[row_index, col_names]

    Name  Salary
2  Ashok   45000
4  Reema   65000

In [60]:
## using iloc method

row_index = [2, 4]
col_index = [0, 2]

data1.iloc[row_index, col_index]

    Name  Salary
2  Ashok   45000
4  Reema   65000

In [62]:
data1

    Name  Age  Salary Gender
0   Anil   22   25000      M
1  Sunil   24   35000      M
2  Ashok   26   45000      M
3  Seema   28   55000      F
4  Reema   30   65000      F

In [63]:
## Display Name and gender of Anil, Seema and Reema

row_index = [0, 3, 4]
col_index = [0, 3]

data1.iloc[row_index, col_index]

    Name Gender
0   Anil      M
3  Seema      F
4  Reema      F

In [65]:
row_index = [0, 3, 4]
col_names = ["Name", "Gender"]

data1.loc[row_index, col_names]

    Name Gender
0   Anil      M
3  Seema      F
4  Reema      F

In [71]:
data1.iloc[0:3, :4]

    Name  Age  Salary Gender
0   Anil   22   25000      M
1  Sunil   24   35000      M
2  Ashok   26   45000      M